TBL_NASA_M02_RSF_KOmegaSST_WF/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		uniform 302.4;
/*
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 302.4;

        // Optional entries
        U               U;
        phi             phi;
        psi             thermo:psi;
*/
    }

    outlet
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }

    topWall
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
