TBL_NASA_M02_RSF_KOmegaSST_WF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          97;
        startFace       26344;
    }
    outlet
    {
        type            patch;
        nFaces          97;
        startFace       26441;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          137;
        startFace       26538;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          113;
        startFace       26675;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          24;
        startFace       26788;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          26578;
        startFace       26812;
    }
)

// ************************************************************************* //
