TBL_NASA_M02_RSF_KOmegaSST_WF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             rhoSimpleFoam;

startFrom               startTime;

startTime               0;

stopAt                  endTime;

endTime                 8;

deltaT                  3.5e-5;

writeControl            adjustableRunTime;

writeInterval           1e-5;

purgeWrite              10;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

timeFormat              general;

timePrecision           6;

runTimeModifiable       true;

adjustTimeStep          yes;

maxCo			0.5;

functions
{}

// ************************************************************************* //
