TBL_NASA_M02_RSF_KOmegaSST_WF/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
default  		steadyState;
}

gradSchemes
{
default			Gauss linear;
}

divSchemes
{
default			none;
div(phi,U)		bounded Gauss upwind;
div(((rho*nuEff)*dev2(T(grad(U)))))	Gauss linear;
div(phi,e)		bounded Gauss upwind;
div(phi,epsilon)	bounded Gauss upwind;
div(phi,k)		bounded Gauss upwind;
div(phi,omega)		Gauss upwind; //selbst eingefÃ¼gt(aus anderem Tut.)
div(phid,p)		Gauss upwind;
div(phi,Ekp)		bounded Gauss upwind;
div((phi|interpolate(rho)),p) 	Gauss upwind;
}

laplacianSchemes
{
default 		Gauss linear corrected;
}

interpolationSchemes
{
default 		linear;
}

snGradSchemes
{
default 		corrected;
}

wallDist
{
method 			meshWave;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
