TBL_NASA_M02_RSF_KOmegaSST_WF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  p
  {
      solver GAMG;
      tolerance 1e-10;
      relTol 0.1;
      smoother GaussSeidel;
      nPreSweeps 0;
      nPostSweeps 2;
      nFinestSweeps 2;
      cacheAgglomeration true;
      nCellsInCoarsestLevel 20;
      agglomerator faceAreaPair;
      mergeLevels 1;
  }
  
  "(U|k|e|omega)"
  {
      solver GAMG;
      tolerance 1e-10;
      relTol 0.1;
      smoother GaussSeidel;
      nPreSweeps 0;
      nPostSweeps 2;
      nFinestSweeps 2;
      cacheAgglomeration true;
      nCellsInCoarsestLevel 20;
      agglomerator faceAreaPair;
      nCellsInCoarsestLevel 20;
  }
}

SIMPLE
{
  nNonOrthogonalCorrectors 0;
  consistent yes;
  transonic no;

  residualControl
  {
     p 1e-12;
     U 1e-12;
     e 1e-12;

     // possibly check turbulence fields
     "(k|epsilon|omega)" 1e-12;
  }

}

relaxationFactors
{
  fields
  {
    p 1;
    rho 1;
  }
  equations
  {
    p 1;
    U 0.9;
    e 0.9;
    k 0.9;
    epsilon 0.9;
    omega 0.9;
  }
}


// ************************************************************************* //

